[
  {
    "id": 1,
    "name": "Adwoa Mensah",
    "location": "University of Ghana, Legon",
    "comment": "As a student researcher, I needed a quiet place to focus on my thesis. Ankes Lodge provided the perfect environment with excellent Wi-Fi and a serene atmosphere. The executive room was spotlessly clean, and the staff went above and beyond to ensure my comfort. I'll definitely be recommending this place to my colleagues!",
    "rating": 5,
    "date": "2025-11-28"
  },
  {
    "id": 2,
    "name": "Kwame Boateng",
    "location": "Accra Institute of Technology",
    "comment": "I stayed at Ankes Lodge for a week-long conference in Sunyani. The location was convenient, and the full house booking option was perfect for our team. The dining hall served delicious local dishes, and the event hall was ideal for our evening discussions. The manager, Prince, was exceptionally helpful throughout our stay.",
    "rating": 5,
    "date": "2025-11-15"
  },
  {
    "id": 3,
    "name": "Akosua Darko",
    "location": "Kumasi, Ghana",
    "comment": "My family and I had the most memorable weekend getaway at Ankes Lodge. The regular bedrooms were spacious and comfortable, with all modern amenities. My kids loved the playground area, and my husband appreciated the secure parking. The breakfast spread was amazing, with both continental and local options. Truly a home away from home!",
    "rating": 5,
    "date": "2025-10-30"
  },
  {
    "id": 4,
    "name": "Yaw Asante",
    "location": "Sunyani Technical University",
    "comment": "I've been staying at Ankes Lodge monthly for my research work, and they never disappoint. The consistency in service quality is remarkable. The air-conditioned rooms are a blessing during the hot season, and the 24/7 security gives me peace of mind. Their laundry service is quick and efficient. Highly recommended for long-term stays!",
    "rating": 5,
    "date": "2025-10-12"
  },
  {
    "id": 5,
    "name": "Afia Osei",
    "location": "Takoradi, Ghana",
    "comment": "We booked the full house for our daughter's birthday celebration, and it was magical! The event hall was beautifully decorated by their team (at no extra cost!), and the catering service exceeded our expectations. The children's play area kept the little ones entertained, while adults enjoyed the serene garden setting. Thank you, Ankes Lodge team, for making this milestone so special!",
    "rating": 5,
    "date": "2025-09-22"
  }
]